In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df = pd.read_csv('./data/Serie_Total2016.csv')
df.timestamp = pd.to_datetime(df.timestamp)
df = df.loc[df.timestamp.dt.hour < 20]
df.head(10)

,element_key,latitude,longitude,timestamp,paid_parking_area,day_year,occupation_perc,prcp,tmax,tmin
0,75865,47.598052,-122.326466,2016-01-02 08:00:00,Chinatown/ID,2,11.76,0.0,42,25
1,75865,47.598052,-122.326466,2016-01-02 09:00:00,Chinatown/ID,2,11.76,0.0,42,25
2,75865,47.598052,-122.326466,2016-01-02 10:00:00,Chinatown/ID,2,11.76,0.0,42,25
3,75865,47.598052,-122.326466,2016-01-02 11:00:00,Chinatown/ID,2,29.41,0.0,42,25
4,75865,47.598052,-122.326466,2016-01-02 12:00:00,Chinatown/ID,2,52.94,0.0,42,25
5,75865,47.598052,-122.326466,2016-01-02 13:00:00,Chinatown/ID,2,47.06,0.0,42,25
6,75865,47.598052,-122.326466,2016-01-02 14:00:00,Chinatown/ID,2,29.41,0.0,42,25
7,75865,47.598052,-122.326466,2016-01-02 15:00:00,Chinatown/ID,2,29.41,0.0,42,25
8,75865,47.598052,-122.326466,2016-01-02 16:00:00,Chinatown/ID,2,41.18,0.0,42,25
9,75865,47.598052,-122.326466,2016-01-02 17:00:00,Chinatown/ID,2,41.18,0.0,42,25

In [3]:
top100_list = [1234, 35845, 35850, 13213, 54737, 35846, 31850, 31849, 63125, 9474, 
               35682, 81210, 32266, 24413, 56654, 30698, 54733, 76961, 18622, 69446,
               69489, 9141, 35681, 85385, 46410, 54730, 24041, 24270, 87257, 13549,
               46254, 13793, 9510, 1021, 1046, 41030, 46409, 69445, 24405, 13214,
               49654, 58514, 34214, 12289, 31493, 70866, 63126, 16942, 76962, 37134,
               81209, 74025, 85381, 28949, 79741, 14677, 35849, 81297, 69098, 24557,
               88773, 1018, 75865, 74029, 32265, 9461, 58513, 37177, 59958, 51485,
               9473, 1433, 75169, 12765, 88634, 81117, 24038, 2926, 34938, 25714,
               7261, 11118, 86449, 1045, 11878, 52525, 8001, 70746, 81421, 24037,
               81194, 62458, 24042, 24265, 1037, 94602, 65817, 59962, 25710, 24266]
df_top100 = df.loc[df.element_key.isin(top100_list)].sort_values(['element_key','timestamp'])

In [4]:
df_top100.paid_parking_area.unique().size
# El top 100 de parquímetros con mayor número de transacciones están distribuidos en 14 del total de 18 distritos

14

In [5]:
df_top100.loc[df_top100.timestamp.dt.month <= 4].groupby(df_top100.timestamp.dt.hour).day_year.count()

timestamp
8      9038
9      9763
10     9985
11    10054
12    10066
13    10066
14    10064
15    10025
16     9819
17     9726
18     9789
19     8522
Name: day_year, dtype: int64

In [6]:
import holidays

hol = holidays.US(state='WA', years=[2016]).items()
hol_days = []
for dat, name in sorted(hol):
    hol_days.append(dat.timetuple().tm_yday)

In [7]:
sundays = [3]
for i in range(1,52):
    sundays.append(i*7+3)

In [8]:
df_top100_days = sorted(df_top100.timestamp.dt.dayofyear.unique())
df_top100_days_sh = list(set().union(sundays, hol_days, df_top100_days))
list(set(list(range(1,367))) ^ set(df_top100_days_sh))

[]

### EK = 1234

In [9]:
ek1234 = df_top100.loc[(df_top100.element_key == 1234) & (df_top100.timestamp.dt.month <= 4)]
ek1234.day_year.unique().size

101

In [10]:
ek1234.head(3)

,element_key,latitude,longitude,timestamp,paid_parking_area,day_year,occupation_perc,prcp,tmax,tmin
5671,1234,47.61471,-122.319331,2016-01-02 08:00:00,Pike-Pine,2,11.43,0.0,42,25
5672,1234,47.61471,-122.319331,2016-01-02 09:00:00,Pike-Pine,2,54.29,0.0,42,25
5673,1234,47.61471,-122.319331,2016-01-02 10:00:00,Pike-Pine,2,54.29,0.0,42,25

In [11]:
ek1234.loc[ek1234.timestamp.dt.month <= 4].groupby(ek1234.timestamp.dt.hour).day_year.count()

timestamp
8     101
9     101
10    101
11    101
12    101
13    101
14    101
15    101
16    101
17    101
18    101
19    101
Name: day_year, dtype: int64

In [12]:
ek1234.to_csv('./data/EK1234_1Q16.csv')

### EK = 35845

In [13]:
ek35845 = df_top100.loc[(df_top100.element_key == 35845) & (df_top100.timestamp.dt.month <= 4)]
ek35845.day_year.unique().size

101

In [14]:
ek35845.head(3)

,element_key,latitude,longitude,timestamp,paid_parking_area,day_year,occupation_perc,prcp,tmax,tmin
7635,35845,47.662283,-122.313216,2016-01-02 09:00:00,University District,2,13.33,0.0,42,25
7636,35845,47.662283,-122.313216,2016-01-02 10:00:00,University District,2,23.33,0.0,42,25
7637,35845,47.662283,-122.313216,2016-01-02 11:00:00,University District,2,46.67,0.0,42,25

In [15]:
ek35845.loc[ek35845.timestamp.dt.month <= 4].groupby(ek35845.timestamp.dt.hour).day_year.count()

timestamp
8      99
9     101
10    101
11    101
12    101
13    101
14    101
15    101
16    101
17    101
18    101
19    101
Name: day_year, dtype: int64

In [16]:
ek35845_8h = ek35845.loc[(ek35845.timestamp.dt.hour == 8) & (ek35845.timestamp.dt.month <= 6)].day_year.unique()
ek35845_19h = ek35845.loc[(ek35845.timestamp.dt.hour == 19) & (ek35845.timestamp.dt.month <= 6)].day_year.unique()
faltan = list(set(ek35845_8h) ^ set(ek35845_19h))  
print(faltan)

[2, 51]

In [17]:
for day in faltan:
    day_nextweek = day + 7
    if day_nextweek in hol_days:
        day_nextweek += 7
    new_row = ek35845.loc[(ek35845.day_year == day_nextweek) & (ek35845.timestamp.dt.hour == 8)]
    new_row.loc[:,'day_year'] = day
    ek35845 = ek35845.append(new_row, ignore_index = True).sort_values(['element_key','timestamp'])

/anaconda3/lib/python3.6/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [18]:
ek35845.to_csv('./data/EK35845_1Q16.csv')

### EK = 35850

In [19]:
ek35850 = df_top100.loc[(df_top100.element_key == 35850) & (df_top100.timestamp.dt.month <= 4)]
ek35850.day_year.unique().size

101

In [20]:
ek35850.head(3)

,element_key,latitude,longitude,timestamp,paid_parking_area,day_year,occupation_perc,prcp,tmax,tmin
4310,35850,47.663992,-122.312985,2016-01-02 08:00:00,University District,2,11.90,0.0,42,25
4311,35850,47.663992,-122.312985,2016-01-02 09:00:00,University District,2,33.33,0.0,42,25
4312,35850,47.663992,-122.312985,2016-01-02 10:00:00,University District,2,42.86,0.0,42,25

In [21]:
ek35850.loc[ek35850.timestamp.dt.month <= 4].groupby(ek35850.timestamp.dt.hour).day_year.count()

timestamp
8     100
9     101
10    101
11    101
12    101
13    101
14    101
15    101
16    101
17    101
18    101
19    101
Name: day_year, dtype: int64

In [22]:
ek35850_8h = ek35850.loc[(ek35850.timestamp.dt.hour == 8) & (ek35850.timestamp.dt.month <= 4)].day_year.unique()
ek35850_19h = ek35850.loc[(ek35850.timestamp.dt.hour == 19) & (ek35850.timestamp.dt.month <= 4)].day_year.unique()
faltan = list(set(ek35850_8h) ^ set(ek35850_19h))  
print(faltan)

[34]

In [23]:
for day in faltan:
    day_nextweek = day + 7
    if day_nextweek in hol_days:
        day_nextweek += 7
    new_row = ek35850.loc[(ek35850.day_year == day_nextweek) & (ek35850.timestamp.dt.hour == 8)]
    new_row.loc[:,'day_year'] = day
    ek35850 = ek35850.append(new_row, ignore_index = True).sort_values(['element_key','timestamp'])

/anaconda3/lib/python3.6/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [24]:
ek35850.to_csv('./data/EK35850_1Q16.csv')

### EK = 13213

In [25]:
ek13213 = df_top100.loc[(df_top100.element_key == 13213) & (df_top100.timestamp.dt.month <= 4)]
ek13213.day_year.unique().size

101

In [26]:
ek13213.head(3)

,element_key,latitude,longitude,timestamp,paid_parking_area,day_year,occupation_perc,prcp,tmax,tmin
2832,13213,47.659092,-122.313296,2016-01-02 08:00:00,University District,2,10.71,0.0,42,25
2833,13213,47.659092,-122.313296,2016-01-02 09:00:00,University District,2,14.29,0.0,42,25
2834,13213,47.659092,-122.313296,2016-01-02 10:00:00,University District,2,10.71,0.0,42,25

In [27]:
ek13213.loc[ek13213.timestamp.dt.month <= 4].groupby(ek13213.timestamp.dt.hour).day_year.count()

timestamp
8     100
9     101
10    101
11    101
12    101
13    101
14    101
15    101
16    101
17    101
18    101
19    101
Name: day_year, dtype: int64

In [28]:
ek13213_8h = ek13213.loc[(ek13213.timestamp.dt.hour == 8) & (ek13213.timestamp.dt.month <= 4)].day_year.unique()
ek13213_19h = ek13213.loc[(ek13213.timestamp.dt.hour == 19) & (ek13213.timestamp.dt.month <= 4)].day_year.unique()
faltan = list(set(ek13213_8h) ^ set(ek13213_19h))  
for day in faltan:
    day_nextweek = day + 7
    if day_nextweek in hol_days:
        day_nextweek += 7
    new_row = ek13213.loc[(ek13213.day_year == day_nextweek) & (ek13213.timestamp.dt.hour == 8)]
    new_row.loc[:,'day_year'] = day
    ek13213 = ek13213.append(new_row, ignore_index = True).sort_values(['element_key','timestamp'])

/anaconda3/lib/python3.6/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [29]:
ek13213.to_csv('./data/EK13213_1Q16.csv')

### EK = 54737

In [30]:
ek54737 = df_top100.loc[(df_top100.element_key == 54737) & (df_top100.timestamp.dt.month <= 4)]
ek54737.day_year.unique().size

101

In [31]:
ek54737.head(3)

,element_key,latitude,longitude,timestamp,paid_parking_area,day_year,occupation_perc,prcp,tmax,tmin
5787,54737,47.623721,-122.321059,2016-01-02 08:00:00,Capitol Hill,2,7.69,0.0,42,25
5788,54737,47.623721,-122.321059,2016-01-02 09:00:00,Capitol Hill,2,26.92,0.0,42,25
5789,54737,47.623721,-122.321059,2016-01-02 10:00:00,Capitol Hill,2,34.62,0.0,42,25

In [32]:
ek54737.loc[ek54737.timestamp.dt.month <= 4].groupby(ek54737.timestamp.dt.hour).day_year.count()

timestamp
8     101
9     101
10    101
11    101
12    101
13    101
14    101
15    101
16    101
17    101
18    101
19    101
Name: day_year, dtype: int64

In [33]:
ek54737.to_csv('./data/EK54737_1Q16.csv')

### TOP5 fusión

In [34]:
ek_top5 = pd.concat([ek1234,ek35845,ek35850,ek13213,ek54737])

In [35]:
ek_top5.to_csv('./data/EK_top5_1Q16.csv')

In [36]:
ek_top5.shape

(6060, 10)